--INSERT INTO students (name, kana_name, nickname, email, area, age, sex, isDeleted)
--VALUES ( '山田太郎', 'ヤマダタロウ', 'タロ', 'taro@example.com', '東京', 25, '男性', false),
       --( '鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性', false),
       --( '田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性', false),
       --( '佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性', false),
       --( '伊藤悠',   'イトウハルカ',   'ハル', 'haruka@example.com', '愛知', 35, 'その他', false);

--INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at)
--VALUES ( 1001, '簿記検定', '2005-05-07 00:00:00', '2007-07-08 00:00:00'),
       --( 1002, '簿記検定', '2005-08-09 00:00:00', '2006-07-31 00:00:00'),
       --( 1003, 'デザイン', '2007-12-09 00:00:00', '2032-12-31 00:00:00'),
       --( 1004, 'Wold', '2006-02-28 00:00:00', '2009-09-29 00:00:00'),
       --( 1005, 'JAVA', '2006-09-17 00:00:00', '2022-10-17 00:00:00'),
       --( 1020, 'AWSコース', '2025-03-01 15:32:19', '2026-03-01 15:32:19'),
       --( 1022, 'Javaコース', '2025-03-16 04:11:02', '2026-03-16 04:11:02'),
       --( 1050, 'AWSコース', '2025-05-31 14:25:51', '2026-05-31 14:25:51');

INSERT INTO students (id, name, kana_name, nickname, email, area, age, sex, isDeleted)
VALUES ( '1001', '山田太郎', 'ヤマダタロウ', 'タロ', 'taro@example.com', '東京', 25, '男性', false),
       ( '1002', '鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性', false),
       ( '1003', '田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性', false),
       ( '1004', '佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性', false),
       ( '1005', '伊藤悠',   'イトウハルカ',   'ハル', 'haruka@example.com', '愛知', 35, 'その他', false);

INSERT INTO student_couses (id, student_id, course_name, course_start_at, course_end_at)
VALUES ( '101', '1001', '簿記検定', '2005-05-07 00:00:00', '2007-07-08 00:00:00'),
       ( '102', '1002', '簿記検定', '2005-08-09 00:00:00', '2006-07-31 00:00:00'),
       ( '103', '1003', 'デザイン', '2007-12-09 00:00:00', '2032-12-31 00:00:00'),
       ( '104', '1004', 'Wold', '2006-02-28 00:00:00', '2009-09-29 00:00:00'),
       ( '105', '1005', 'JAVA', '2006-09-17 00:00:00', '2022-10-17 00:00:00'),
       ( '106', '1020', 'AWSコース', '2025-03-01 15:32:19', '2026-03-01 15:32:19'),
       ( '107', '1022', 'Javaコース', '2025-03-16 04:11:02', '2026-03-16 04:11:02'),
       ( '108', '1050', 'AWSコース', '2025-05-31 14:25:51', '2026-05-31 14:25:51');
